Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl
The Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl class represents a control that can contain text and images,
and can be clicked using the mouse or the keyboard.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.internalControl
The internal control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.#ctor
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl class.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl class.
text: The text.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.#ctor(System.Drawing.Image)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl class.
image: The image.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.#ctor(System.String,System.Drawing.Image)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl class.
text: The text.
image: The image.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.Clicked
Event to be called when the button is clicked.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.InternalControl


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.ButtonControl.OnClicked(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the click event.
sender: The sender.